namespace Silo.Application.Features;
public enum DocumentCheckType
{
    None = 0,
    //اقلام شناسایی شده و اقلام سند باید کاملا منطبق باشد
    //یعنی همه کالاهای شناسایی شده در سند باشد و همه اقلام سند شناسایی شده باشد
    //همچنین مقدار شناسایی شده ی هر کالا دقیقا برابر با مقدار سندی آن باشد
    Exact = 1,
    //اقلام شناسایی شده حتما باید در سند باشد اما نیازی نیست همه اقلام سند شناسایی شده باشد
    //یعنی اقلام یک سند ممکن است در دفعات مختلف شناسایی شده و جابجا شود
    //علاوه بر نکات بالا، مفهومی به نام مقدار باقیمانده وجود دارد،
    //یعنی اختلاف مقدار سندی آن کد کالا با مقداری که از آن کد کالا قبلا جابجایی آن ثبت شده است
    //پس کالای خارج از سند نمیتوان ثبت کرد
    //نیازی نیست همه کالاهای سند شناسایی شده باشد
    //هر کالایی از سند که شناسایی شده به شرطی میتواند جابجا شود که مقدار جابجا شده آن کد کالا در دفعات قبل از مقدار سند بیشتر نشده باشد
    //مقدار باقیمانده = مقدار کد کالا در سند - مقدار جابجا شده در دفعات قبل
    ProductCodeAndDocCodeRemain=2,
    //در این نوع بررسی کد کالا مهم نیست
    //فقط مقدار کلی شناسایی شده باید با مقدار کلی سند برابر باشد
    //مجموع اقلام کل سند = مجموع کل اقلام شناسایی شده
    DocCodeRemain=3
}
